app/controllers/play_invitations_controller.rb

  def create
    @play_invitation = PlayInvitation.new(play_invitation_params)
    @play_invitation.invited_at = Time.now

    respond_to do |format|
      if @play_invitation.save
        EventLog.createPlayInvitation current_user, @play_invitation
---
INSERT INTO "play_invitations" ("app_id", "child_id", "created_at", "duration", "end_time", "invitation_text", "invited_at", "invited_child_id", "place_id", "proposed_duration", "proposed_end_time", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "event_logs" ("child1_id", "child2_id", "created_at", "details", "event_type", "family1_id", "family2_id", "initiator_id", "initiator_type", "mode_type", "parent1_id", "parent2_id", "record_id", "record_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

    def set_play_invitation
      @play_invitation = PlayInvitation.find(params[:id])
---
SELECT  "play_invitations".* FROM "play_invitations"  WHERE "play_invitations"."id" = $1 LIMIT 1  [["id", 3]]